#include "sleep.h";

/*====================================================
*函数名:IOCA1_INIT
*功能:开启程序所需的中断源
*输入参数:无
*返回参数:无
====================================================*/
void IOCA1_INIT(void)
{
	IOCA1 = 1;
	Temp_Read = PORTA;
	PAIF = 0;
	PAIE = 0;
}

 /*====================================================
*函数名:sleep_init
*功能:休眠初始化
*输入参数:无
*返回参数:无
====================================================*/
void sleep_init(void)
{
		GIE = 0;	//如果程序中有开启中断,在休眠前暂时关闭总中断
		ADON = 0;	//如果程序有用到ADC,需要关闭ADC电路
		CLRWDT();
		TMR1ON = 0;  		//定时器1际?
		TMR1IE = 0;				//使能TIMER1中断
		SWDTEN = 0;	//软件关闭看门狗
		//看门狗可以被设置为一直开启无法软件关闭,也可以为软件开启or关闭
		//如果配置位选项WDTE被设置为Enable,则看门狗一直开启无法软件关闭
		//如果配置位选项WDTE被设置为Disable,则看门狗可以被软件开启or关闭
		SLVREN = 0;	//关闭低电压复位,低电压复位功耗大概是20uA
		//低电压复位的软开关和硬件自动开关可有配置位设置
		//具体可以参照配置位选项表的LVREN选项的说明
		//此例程LVREN选项是选择了SLVREN(低电压复位由程序控制开关)
		IOCA1 = 1;
		Temp_Read = PORTA;	//清除失配状态
		PAIF = 0;
		PAIE = 1;			//开启IO电平变化中断
		SLEEP();
		NOP();
		PAIE = 0;			//关闭IO电平变化中断
		Temp_Read = PORTA;	//清除失配状态
		PAIF = 0;
		SWDTEN = 1; //软件开启看门狗
		SLVREN = 1;
		CLRWDT();
		TMR1ON = 1;  		//定时器1际?
		TMR1IE = 1;				//使能TIMER1中断
		GIE = 1;	//如果程序中有开启中断,恢复开启总中断
}

/*====================================================
*函数名:sleep_open
*功能:进入休眠
*输入参数:无
*返回参数:无
====================================================*/
 void sleep_open(void) 
 {
	if(deviceStatus == DEVICE_STOP){      //停止工作1秒后进入休眠状态
		if(deviceSeepCnt >= 200){
			deviceSeepCnt = 0;
			sleep_init();
		}
	}
}