#include "time.h";

//[TMR1H:TMR1L]=0x3CAF=15535,2T指令周期,内部RC频率4MHz,预分频值1:4 
//定时溢出时长=(1/4MHz)*2*4*(65535-15535)=100ms
//[TMR1H:TMR1L]=0xF63B,2T指令周期,内部RC频率4MHz,预分频值1:4 
//定时溢出时长=(1/4MHz)*2*4*(65535-65035)=5ms
/*====================================================
*函数名:TIMER1_INIT
*功能:Tiemr1初始化
*输入参数:无
*返回参数:无
====================================================*/
void TIMER1_INIT(void)
{
	TMR1H = 0xF6;
	TMR1L = 0x3B;
	T1CON = 0B00100000;		//预分频值=1:4
}

/*====================================================
*函数名:ENABLE_INTERRUPT
*功能:开启所需中断
*功能:开启所需中断
*输入参数:无
*返回参数:无
//注:Timer1属于外设,所以要开启Timer1溢出中断，必须把外设总闸PEIE开启
====================================================*/
void ENABLE_INTERRUPT(void)
{
	TMR1IF = 0;				//清TIMER1中断标志位
	TMR1IE = 1;				//使能TIMER1中断
    PEIE = 1;
	GIE = 1;				//开启总中断
    TMR1ON = 1;  		//定时器1计数
}
